{"format": "graph-model", "generatedBy": "1.12.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "outputs": {"density_1/convolution:0": {"name": "density_1/convolution:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "deconv_2_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_2_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_2_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_2_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_2_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_2_1/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "deconv_2_1/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_2_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_2_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "8"}]}}}}}, {"name": "deconv_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_1_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_1_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_1_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "deconv_1_1/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_1_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "deconv_1_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout_1/dropout/div_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/dropout/keep_prob", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "decon_seg_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "decon_seg_2_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "decon_seg_2_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "decon_seg_2_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "decon_seg_2_1/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "decon_seg_2_1/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "decon_seg_2_1/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "decon_seg_2_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "8"}]}}}}}, {"name": "deconv_seg_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_seg_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_seg_1_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_seg_1_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_seg_1_1/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "deconv_seg_1_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout_seg_1/dropout/div_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_seg_1/dropout/keep_prob", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "hist_norm_1/Min/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "hist_norm_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "hist_norm_1/Min_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "conv_seg_1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_seg_1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_stride_1_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "conv_stride_1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_seg_2_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "conv_seg_2_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv_stride_2_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_stride_2_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv_seg_3_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "conv_seg_3_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deconv_seg_1_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "decon_seg_2_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "seg_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_2_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "conv_2_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_3_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_3_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv_4_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "conv_4_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv_5_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "conv_5_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "deconv_1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "deconv_2_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "density_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "hist_norm_1/Min", "op": "Min", "input": ["input_1", "hist_norm_1/Min/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "hist_norm_1/Max", "op": "Max", "input": ["input_1", "hist_norm_1/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "hist_norm_1/Min_1", "op": "Min", "input": ["input_1", "hist_norm_1/Min_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "hist_norm_1/sub", "op": "Sub", "input": ["input_1", "hist_norm_1/Min"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hist_norm_1/sub_1", "op": "Sub", "input": ["hist_norm_1/Max", "hist_norm_1/Min_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hist_norm_1/truediv", "op": "RealDiv", "input": ["hist_norm_1/sub", "hist_norm_1/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_seg_1_1/Relu", "op": "_FusedConv2D", "input": ["hist_norm_1/truediv", "conv_seg_1_1/kernel", "conv_seg_1_1/bias"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv_stride_1_1/Relu", "op": "_FusedConv2D", "input": ["conv_seg_1_1/Relu", "conv_stride_1_1/kernel", "conv_stride_1_1/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv_seg_2_1/Relu", "op": "_FusedConv2D", "input": ["conv_stride_1_1/Relu", "conv_seg_2_1/kernel", "conv_seg_2_1/bias"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "conv_stride_2_1/Relu", "op": "_FusedConv2D", "input": ["conv_seg_2_1/Relu", "conv_stride_2_1/kernel", "conv_stride_2_1/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv_seg_3_1/Relu", "op": "_FusedConv2D", "input": ["conv_stride_2_1/Relu", "conv_seg_3_1/kernel", "conv_seg_3_1/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "dropout_seg_1/dropout/div", "op": "Mul", "input": ["ConstantFolding/dropout_seg_1/dropout/div_recip", "conv_seg_3_1/Relu"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_seg_1/dropout/Shape", "op": "Shape", "input": ["conv_seg_3_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_seg_1/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_seg_1/dropout/Shape"], "attr": {"T": {"type": "DT_INT32"}, "seed": {"i": "87654321"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "7620016"}}}, {"name": "dropout_seg_1/dropout/add", "op": "Add", "input": ["dropout_seg_1/dropout/keep_prob", "dropout_seg_1/dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_seg_1/dropout/Floor", "op": "Floor", "input": ["dropout_seg_1/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_seg_1/dropout/mul", "op": "Mul", "input": ["dropout_seg_1/dropout/div", "dropout_seg_1/dropout/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "deconv_seg_1_1/Shape", "op": "Shape", "input": ["dropout_seg_1/dropout/mul"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "deconv_seg_1_1/strided_slice", "op": "StridedSlice", "input": ["deconv_seg_1_1/Shape", "deconv_seg_1_1/strided_slice/stack", "deconv_seg_1_1/strided_slice/stack_1", "deconv_seg_1_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "deconv_seg_1_1/strided_slice_1", "op": "StridedSlice", "input": ["deconv_seg_1_1/Shape", "deconv_seg_1_1/strided_slice_1/stack", "deconv_seg_1_1/strided_slice_1/stack_1", "deconv_seg_1_1/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "deconv_seg_1_1/strided_slice_2", "op": "StridedSlice", "input": ["deconv_seg_1_1/Shape", "deconv_seg_1_1/strided_slice_2/stack", "deconv_seg_1_1/strided_slice_2/stack_1", "deconv_seg_1_1/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "deconv_seg_1_1/mul", "op": "Mul", "input": ["deconv_seg_1_1/strided_slice_1", "deconv_seg_1_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/mul_1", "op": "Mul", "input": ["deconv_seg_1_1/strided_slice_2", "deconv_seg_1_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/stack", "op": "Pack", "input": ["deconv_seg_1_1/strided_slice", "deconv_seg_1_1/mul", "deconv_seg_1_1/mul_1", "deconv_seg_1_1/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "deconv_seg_1_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["deconv_seg_1_1/stack", "deconv_seg_1_1/kernel", "dropout_seg_1/dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "deconv_seg_1_1/BiasAdd", "op": "BiasAdd", "input": ["deconv_seg_1_1/conv2d_transpose", "deconv_seg_1_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "deconv_seg_1_1/Relu", "op": "Relu", "input": ["deconv_seg_1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decon_seg_2_1/Shape", "op": "Shape", "input": ["deconv_seg_1_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "decon_seg_2_1/strided_slice", "op": "StridedSlice", "input": ["decon_seg_2_1/Shape", "decon_seg_2_1/strided_slice/stack", "decon_seg_2_1/strided_slice/stack_1", "decon_seg_2_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/strided_slice_1", "op": "StridedSlice", "input": ["decon_seg_2_1/Shape", "decon_seg_2_1/strided_slice_1/stack", "decon_seg_2_1/strided_slice_1/stack_1", "decon_seg_2_1/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "decon_seg_2_1/strided_slice_2", "op": "StridedSlice", "input": ["decon_seg_2_1/Shape", "decon_seg_2_1/strided_slice_2/stack", "decon_seg_2_1/strided_slice_2/stack_1", "decon_seg_2_1/strided_slice_2/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "decon_seg_2_1/mul", "op": "Mul", "input": ["decon_seg_2_1/strided_slice_1", "decon_seg_2_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/mul_1", "op": "Mul", "input": ["decon_seg_2_1/strided_slice_2", "decon_seg_2_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decon_seg_2_1/stack", "op": "Pack", "input": ["decon_seg_2_1/strided_slice", "decon_seg_2_1/mul", "decon_seg_2_1/mul_1", "decon_seg_2_1/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "decon_seg_2_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decon_seg_2_1/stack", "decon_seg_2_1/kernel", "deconv_seg_1_1/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "decon_seg_2_1/BiasAdd", "op": "BiasAdd", "input": ["decon_seg_2_1/conv2d_transpose", "decon_seg_2_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decon_seg_2_1/Relu", "op": "Relu", "input": ["decon_seg_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "seg_1/convolution", "op": "Conv2D", "input": ["decon_seg_2_1/Relu", "seg_1/kernel"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "seg_1/Sigmoid", "op": "Sigmoid", "input": ["seg_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_1_1/Relu", "op": "_FusedConv2D", "input": ["seg_1/Sigmoid", "conv_1_1/kernel", "conv_1_1/bias"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_2_1/Relu", "op": "_FusedConv2D", "input": ["conv_1_1/Relu", "conv_2_1/kernel", "conv_2_1/bias"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_3_1/Relu", "op": "_FusedConv2D", "input": ["conv_2_1/Relu", "conv_3_1/kernel", "conv_3_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}}}, {"name": "conv_4_1/Relu", "op": "_FusedConv2D", "input": ["conv_3_1/Relu", "conv_4_1/kernel", "conv_4_1/bias"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "conv_5_1/Relu", "op": "_FusedConv2D", "input": ["conv_4_1/Relu", "conv_5_1/kernel", "conv_5_1/bias"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "dropout_1/dropout/div", "op": "Mul", "input": ["ConstantFolding/dropout_1/dropout/div_recip", "conv_5_1/Relu"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/dropout/Shape", "op": "Shape", "input": ["conv_5_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_1/dropout/Shape"], "attr": {"seed": {"i": "87654321"}, "dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "193452"}}}, {"name": "dropout_1/dropout/add", "op": "Add", "input": ["dropout_1/dropout/keep_prob", "dropout_1/dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/dropout/Floor", "op": "Floor", "input": ["dropout_1/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/dropout/mul", "op": "Mul", "input": ["dropout_1/dropout/div", "dropout_1/dropout/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "deconv_1_1/Shape", "op": "Shape", "input": ["dropout_1/dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/strided_slice", "op": "StridedSlice", "input": ["deconv_1_1/Shape", "deconv_1_1/strided_slice/stack", "deconv_1_1/strided_slice/stack_1", "deconv_1_1/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "deconv_1_1/strided_slice_1", "op": "StridedSlice", "input": ["deconv_1_1/Shape", "deconv_1_1/strided_slice_1/stack", "deconv_1_1/strided_slice_1/stack_1", "deconv_1_1/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/strided_slice_2", "op": "StridedSlice", "input": ["deconv_1_1/Shape", "deconv_1_1/strided_slice_2/stack", "deconv_1_1/strided_slice_2/stack_1", "deconv_1_1/strided_slice_2/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "deconv_1_1/mul", "op": "Mul", "input": ["deconv_1_1/strided_slice_1", "deconv_1_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/mul_1", "op": "Mul", "input": ["deconv_1_1/strided_slice_2", "deconv_1_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "deconv_1_1/stack", "op": "Pack", "input": ["deconv_1_1/strided_slice", "deconv_1_1/mul", "deconv_1_1/mul_1", "deconv_1_1/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "deconv_1_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["deconv_1_1/stack", "deconv_1_1/kernel", "dropout_1/dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "deconv_1_1/BiasAdd", "op": "BiasAdd", "input": ["deconv_1_1/conv2d_transpose", "deconv_1_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "deconv_1_1/Relu", "op": "Relu", "input": ["deconv_1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "deconv_2_1/Shape", "op": "Shape", "input": ["deconv_1_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "deconv_2_1/strided_slice", "op": "StridedSlice", "input": ["deconv_2_1/Shape", "deconv_2_1/strided_slice/stack", "deconv_2_1/strided_slice/stack_1", "deconv_2_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "deconv_2_1/strided_slice_1", "op": "StridedSlice", "input": ["deconv_2_1/Shape", "deconv_2_1/strided_slice_1/stack", "deconv_2_1/strided_slice_1/stack_1", "deconv_2_1/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/strided_slice_2", "op": "StridedSlice", "input": ["deconv_2_1/Shape", "deconv_2_1/strided_slice_2/stack", "deconv_2_1/strided_slice_2/stack_1", "deconv_2_1/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "deconv_2_1/mul", "op": "Mul", "input": ["deconv_2_1/strided_slice_1", "deconv_2_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/mul_1", "op": "Mul", "input": ["deconv_2_1/strided_slice_2", "deconv_2_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/stack", "op": "Pack", "input": ["deconv_2_1/strided_slice", "deconv_2_1/mul", "deconv_2_1/mul_1", "deconv_2_1/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "deconv_2_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["deconv_2_1/stack", "deconv_2_1/kernel", "deconv_1_1/Relu"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "deconv_2_1/BiasAdd", "op": "BiasAdd", "input": ["deconv_2_1/conv2d_transpose", "deconv_2_1/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "deconv_2_1/Relu", "op": "Relu", "input": ["deconv_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "density_1/convolution", "op": "Conv2D", "input": ["deconv_2_1/Relu", "density_1/kernel"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "deconv_2_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/mul/y", "shape": [], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_2_1/mul_1/y", "shape": [], "dtype": "int32"}, {"name": "deconv_2_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "deconv_2_1/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "deconv_1_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/mul/y", "shape": [], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_1_1/mul_1/y", "shape": [], "dtype": "int32"}, {"name": "deconv_1_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "deconv_1_1/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "ConstantFolding/dropout_1/dropout/div_recip", "shape": [], "dtype": "float32"}, {"name": "dropout_1/dropout/keep_prob", "shape": [], "dtype": "float32"}, {"name": "decon_seg_2_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/mul/y", "shape": [], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "decon_seg_2_1/mul_1/y", "shape": [], "dtype": "int32"}, {"name": "decon_seg_2_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "decon_seg_2_1/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "deconv_seg_1_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/mul/y", "shape": [], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "deconv_seg_1_1/mul_1/y", "shape": [], "dtype": "int32"}, {"name": "deconv_seg_1_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "deconv_seg_1_1/kernel", "shape": [3, 3, 8, 64], "dtype": "float32"}, {"name": "ConstantFolding/dropout_seg_1/dropout/div_recip", "shape": [], "dtype": "float32"}, {"name": "dropout_seg_1/dropout/keep_prob", "shape": [], "dtype": "float32"}, {"name": "hist_norm_1/Min/reduction_indices", "shape": [3], "dtype": "int32"}, {"name": "hist_norm_1/Max/reduction_indices", "shape": [3], "dtype": "int32"}, {"name": "hist_norm_1/Min_1/reduction_indices", "shape": [3], "dtype": "int32"}, {"name": "conv_seg_1_1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "conv_seg_1_1/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_stride_1_1/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv_stride_1_1/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_seg_2_1/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv_seg_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_stride_2_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_stride_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_seg_3_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv_seg_3_1/bias", "shape": [64], "dtype": "float32"}, {"name": "deconv_seg_1_1/bias", "shape": [8], "dtype": "float32"}, {"name": "decon_seg_2_1/bias", "shape": [8], "dtype": "float32"}, {"name": "seg_1/kernel", "shape": [1, 1, 8, 1], "dtype": "float32"}, {"name": "conv_1_1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "conv_1_1/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_2_1/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv_2_1/bias", "shape": [16], "dtype": "float32"}, {"name": "conv_3_1/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_4_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv_4_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_5_1/kernel", "shape": [5, 5, 32, 64], "dtype": "float32"}, {"name": "conv_5_1/bias", "shape": [64], "dtype": "float32"}, {"name": "deconv_1_1/bias", "shape": [8], "dtype": "float32"}, {"name": "deconv_2_1/bias", "shape": [8], "dtype": "float32"}, {"name": "density_1/kernel", "shape": [1, 1, 8, 1], "dtype": "float32"}]}]}