{"format": "graph-model", "generatedBy": "1.13.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_23:0": {"name": "input_23:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}}, "outputs": {"conv2d_552/Sigmoid:0": {"name": "conv2d_552/Sigmoid:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "conv2d_529/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_529/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv2d_530/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "conv2d_530/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv2d_531/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "conv2d_531/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_532/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "conv2d_532/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_533/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_533/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "conv2d_534/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_534/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_535/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "conv2d_535/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv2d_536/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "conv2d_536/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv2d_537/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_537/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_538/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "conv2d_538/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "dropout_1/keras_learning_phase/input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "up_sampling2d_89/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_89/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "up_sampling2d_89/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_89/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "conv2d_539/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_539/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "concatenate_89/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_540/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "512"}]}}}}}, {"name": "conv2d_540/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_541/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "conv2d_541/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "up_sampling2d_90/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_90/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_90/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_90/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "conv2d_542/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_542/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "concatenate_90/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_543/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_543/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_544/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "conv2d_544/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_91/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_91/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_91/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "up_sampling2d_91/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_545/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "256"}, {"size": "128"}]}}}}}, {"name": "conv2d_545/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "concatenate_91/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "conv2d_546/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}}}, {"name": "conv2d_546/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "conv2d_547/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "conv2d_547/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_92/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "up_sampling2d_92/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "up_sampling2d_92/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "up_sampling2d_92/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "conv2d_548/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "128"}, {"size": "64"}]}}}}}, {"name": "conv2d_548/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "concatenate_92/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_549/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_549/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_550/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_550/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv2d_551/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "2"}]}}}}}, {"name": "conv2d_551/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_552/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "2"}, {"size": "1"}]}}}}}, {"name": "conv2d_552/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_23", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "1"}]}}}}, {"name": "dropout_1/keras_learning_phase", "op": "PlaceholderWithDefault", "input": ["dropout_1/keras_learning_phase/input"], "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "conv2d_529/Relu", "op": "_FusedConv2D", "input": ["input_23", "conv2d_529/kernel", "conv2d_529/bias"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "dropout_45/cond/Switch", "op": "Switch", "input": ["dropout_1/keras_learning_phase", "dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "dropout_46/cond/Switch", "op": "Switch", "input": ["dropout_1/keras_learning_phase", "dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "conv2d_530/Relu", "op": "_FusedConv2D", "input": ["conv2d_529/Relu", "conv2d_530/kernel", "conv2d_530/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "dropout_45/cond/switch_t", "op": "Identity", "input": ["dropout_45/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "dropout_46/cond/switch_t", "op": "Identity", "input": ["dropout_46/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "max_pooling2d_89/MaxPool", "op": "MaxPool", "input": ["conv2d_530/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "ConstantFolding/dropout_45/cond/dropout/truediv_recip", "op": "Const", "input": ["^dropout_45/cond/switch_t"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_45/cond/dropout/sub", "op": "Const", "input": ["^dropout_45/cond/switch_t"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/dropout_46/cond/dropout/truediv_recip", "op": "Const", "input": ["^dropout_46/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_46/cond/dropout/sub", "op": "Const", "input": ["^dropout_46/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_531/Relu", "op": "_FusedConv2D", "input": ["max_pooling2d_89/MaxPool", "conv2d_531/kernel", "conv2d_531/bias"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2d_532/Relu", "op": "_FusedConv2D", "input": ["conv2d_531/Relu", "conv2d_532/kernel", "conv2d_532/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "max_pooling2d_90/MaxPool", "op": "MaxPool", "input": ["conv2d_532/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv2d_533/Relu", "op": "_FusedConv2D", "input": ["max_pooling2d_90/MaxPool", "conv2d_533/kernel", "conv2d_533/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv2d_534/Relu", "op": "_FusedConv2D", "input": ["conv2d_533/Relu", "conv2d_534/kernel", "conv2d_534/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "max_pooling2d_91/MaxPool", "op": "MaxPool", "input": ["conv2d_534/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_535/Relu", "op": "_FusedConv2D", "input": ["max_pooling2d_91/MaxPool", "conv2d_535/kernel", "conv2d_535/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2d_536/Relu", "op": "_FusedConv2D", "input": ["conv2d_535/Relu", "conv2d_536/kernel", "conv2d_536/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "dropout_45/cond/Switch_1", "op": "Switch", "input": ["conv2d_536/Relu", "dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_45/cond/mul/Switch", "op": "Switch", "input": ["conv2d_536/Relu", "dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_45/cond/dropout/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_45/cond/dropout/truediv_recip", "dropout_45/cond/mul/Switch:1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_45/cond/dropout/Shape", "op": "Shape", "input": ["dropout_45/cond/mul/Switch:1", "^dropout_45/cond/switch_t"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_45/cond/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_45/cond/dropout/Shape"], "attr": {"seed": {"i": "87654321"}, "seed2": {"i": "7795215"}, "dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}}}, {"name": "dropout_45/cond/dropout/add", "op": "Add", "input": ["dropout_45/cond/dropout/sub", "dropout_45/cond/dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_45/cond/dropout/Floor", "op": "Floor", "input": ["dropout_45/cond/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_45/cond/dropout/mul", "op": "Mul", "input": ["dropout_45/cond/dropout/truediv", "dropout_45/cond/dropout/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_45/cond/Merge", "op": "Merge", "input": ["dropout_45/cond/Switch_1", "dropout_45/cond/dropout/mul"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_92/MaxPool", "op": "MaxPool", "input": ["dropout_45/cond/Merge"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv2d_537/Relu", "op": "_FusedConv2D", "input": ["max_pooling2d_92/MaxPool", "conv2d_537/kernel", "conv2d_537/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2d_538/Relu", "op": "_FusedConv2D", "input": ["conv2d_537/Relu", "conv2d_538/kernel", "conv2d_538/bias"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "dropout_46/cond/Switch_1", "op": "Switch", "input": ["conv2d_538/Relu", "dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_46/cond/mul/Switch", "op": "Switch", "input": ["conv2d_538/Relu", "dropout_1/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_46/cond/dropout/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_46/cond/dropout/truediv_recip", "dropout_46/cond/mul/Switch:1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_46/cond/dropout/Shape", "op": "Shape", "input": ["dropout_46/cond/mul/Switch:1", "^dropout_46/cond/switch_t"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_46/cond/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_46/cond/dropout/Shape"], "attr": {"seed": {"i": "87654321"}, "dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "7715777"}}}, {"name": "dropout_46/cond/dropout/add", "op": "Add", "input": ["dropout_46/cond/dropout/sub", "dropout_46/cond/dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_46/cond/dropout/Floor", "op": "Floor", "input": ["dropout_46/cond/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_46/cond/dropout/mul", "op": "Mul", "input": ["dropout_46/cond/dropout/truediv", "dropout_46/cond/dropout/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_46/cond/Merge", "op": "Merge", "input": ["dropout_46/cond/Switch_1", "dropout_46/cond/dropout/mul"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_89/Shape", "op": "Shape", "input": ["dropout_46/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_89/strided_slice", "op": "StridedSlice", "input": ["up_sampling2d_89/Shape", "up_sampling2d_89/strided_slice/stack", "up_sampling2d_89/strided_slice/stack_1", "up_sampling2d_89/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "up_sampling2d_89/mul", "op": "Mul", "input": ["up_sampling2d_89/strided_slice", "up_sampling2d_89/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_89/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["dropout_46/cond/Merge", "up_sampling2d_89/mul"], "attr": {"half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "conv2d_539/Relu", "op": "_FusedConv2D", "input": ["up_sampling2d_89/ResizeNearestNeighbor", "conv2d_539/kernel", "conv2d_539/bias"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}}}, {"name": "concatenate_89/concat", "op": "ConcatV2", "input": ["dropout_45/cond/Merge", "conv2d_539/Relu", "concatenate_89/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "conv2d_540/Relu", "op": "_FusedConv2D", "input": ["concatenate_89/concat", "conv2d_540/kernel", "conv2d_540/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}}}, {"name": "conv2d_541/Relu", "op": "_FusedConv2D", "input": ["conv2d_540/Relu", "conv2d_541/kernel", "conv2d_541/bias"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "up_sampling2d_90/Shape", "op": "Shape", "input": ["conv2d_541/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_90/strided_slice", "op": "StridedSlice", "input": ["up_sampling2d_90/Shape", "up_sampling2d_90/strided_slice/stack", "up_sampling2d_90/strided_slice/stack_1", "up_sampling2d_90/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "up_sampling2d_90/mul", "op": "Mul", "input": ["up_sampling2d_90/strided_slice", "up_sampling2d_90/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_90/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["conv2d_541/Relu", "up_sampling2d_90/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": false}}}, {"name": "conv2d_542/Relu", "op": "_FusedConv2D", "input": ["up_sampling2d_90/ResizeNearestNeighbor", "conv2d_542/kernel", "conv2d_542/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "concatenate_90/concat", "op": "ConcatV2", "input": ["conv2d_534/Relu", "conv2d_542/Relu", "concatenate_90/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_543/Relu", "op": "_FusedConv2D", "input": ["concatenate_90/concat", "conv2d_543/kernel", "conv2d_543/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv2d_544/Relu", "op": "_FusedConv2D", "input": ["conv2d_543/Relu", "conv2d_544/kernel", "conv2d_544/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "up_sampling2d_91/Shape", "op": "Shape", "input": ["conv2d_544/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_91/strided_slice", "op": "StridedSlice", "input": ["up_sampling2d_91/Shape", "up_sampling2d_91/strided_slice/stack", "up_sampling2d_91/strided_slice/stack_1", "up_sampling2d_91/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "up_sampling2d_91/mul", "op": "Mul", "input": ["up_sampling2d_91/strided_slice", "up_sampling2d_91/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_91/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["conv2d_544/Relu", "up_sampling2d_91/mul"], "attr": {"half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "conv2d_545/Relu", "op": "_FusedConv2D", "input": ["up_sampling2d_91/ResizeNearestNeighbor", "conv2d_545/kernel", "conv2d_545/bias"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}}}, {"name": "concatenate_91/concat", "op": "ConcatV2", "input": ["conv2d_532/Relu", "conv2d_545/Relu", "concatenate_91/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_546/Relu", "op": "_FusedConv2D", "input": ["concatenate_91/concat", "conv2d_546/kernel", "conv2d_546/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_547/Relu", "op": "_FusedConv2D", "input": ["conv2d_546/Relu", "conv2d_547/kernel", "conv2d_547/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "up_sampling2d_92/Shape", "op": "Shape", "input": ["conv2d_547/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_92/strided_slice", "op": "StridedSlice", "input": ["up_sampling2d_92/Shape", "up_sampling2d_92/strided_slice/stack", "up_sampling2d_92/strided_slice/stack_1", "up_sampling2d_92/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_92/mul", "op": "Mul", "input": ["up_sampling2d_92/strided_slice", "up_sampling2d_92/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_92/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["conv2d_547/Relu", "up_sampling2d_92/mul"], "attr": {"align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": false}}}, {"name": "conv2d_548/Relu", "op": "_FusedConv2D", "input": ["up_sampling2d_92/ResizeNearestNeighbor", "conv2d_548/kernel", "conv2d_548/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "concatenate_92/concat", "op": "ConcatV2", "input": ["conv2d_530/Relu", "conv2d_548/Relu", "concatenate_92/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "conv2d_549/Relu", "op": "_FusedConv2D", "input": ["concatenate_92/concat", "conv2d_549/kernel", "conv2d_549/bias"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv2d_550/Relu", "op": "_FusedConv2D", "input": ["conv2d_549/Relu", "conv2d_550/kernel", "conv2d_550/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "conv2d_551/Relu", "op": "_FusedConv2D", "input": ["conv2d_550/Relu", "conv2d_551/kernel", "conv2d_551/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv2d_552/BiasAdd", "op": "_FusedConv2D", "input": ["conv2d_551/Relu", "conv2d_552/kernel", "conv2d_552/bias"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_552/Sigmoid", "op": "Sigmoid", "input": ["conv2d_552/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of30.bin", "group1-shard2of30.bin", "group1-shard3of30.bin", "group1-shard4of30.bin", "group1-shard5of30.bin", "group1-shard6of30.bin", "group1-shard7of30.bin", "group1-shard8of30.bin", "group1-shard9of30.bin", "group1-shard10of30.bin", "group1-shard11of30.bin", "group1-shard12of30.bin", "group1-shard13of30.bin", "group1-shard14of30.bin", "group1-shard15of30.bin", "group1-shard16of30.bin", "group1-shard17of30.bin", "group1-shard18of30.bin", "group1-shard19of30.bin", "group1-shard20of30.bin", "group1-shard21of30.bin", "group1-shard22of30.bin", "group1-shard23of30.bin", "group1-shard24of30.bin", "group1-shard25of30.bin", "group1-shard26of30.bin", "group1-shard27of30.bin", "group1-shard28of30.bin", "group1-shard29of30.bin", "group1-shard30of30.bin"], "weights": [{"name": "conv2d_529/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d_529/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_530/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_530/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_531/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_531/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_532/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_532/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_533/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_533/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_534/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_534/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_535/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_535/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_536/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_536/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_537/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "conv2d_537/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_538/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_538/bias", "shape": [1024], "dtype": "float32"}, {"name": "dropout_1/keras_learning_phase/input", "shape": [], "dtype": "bool"}, {"name": "up_sampling2d_89/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_89/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_89/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_89/Const", "shape": [2], "dtype": "int32"}, {"name": "conv2d_539/kernel", "shape": [2, 2, 1024, 512], "dtype": "float32"}, {"name": "conv2d_539/bias", "shape": [512], "dtype": "float32"}, {"name": "concatenate_89/concat/axis", "shape": [], "dtype": "int32"}, {"name": "conv2d_540/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "conv2d_540/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_541/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_541/bias", "shape": [512], "dtype": "float32"}, {"name": "up_sampling2d_90/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_90/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_90/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_90/Const", "shape": [2], "dtype": "int32"}, {"name": "conv2d_542/kernel", "shape": [2, 2, 512, 256], "dtype": "float32"}, {"name": "conv2d_542/bias", "shape": [256], "dtype": "float32"}, {"name": "concatenate_90/concat/axis", "shape": [], "dtype": "int32"}, {"name": "conv2d_543/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_543/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_544/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_544/bias", "shape": [256], "dtype": "float32"}, {"name": "up_sampling2d_91/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_91/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_91/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_91/Const", "shape": [2], "dtype": "int32"}, {"name": "conv2d_545/kernel", "shape": [2, 2, 256, 128], "dtype": "float32"}, {"name": "conv2d_545/bias", "shape": [128], "dtype": "float32"}, {"name": "concatenate_91/concat/axis", "shape": [], "dtype": "int32"}, {"name": "conv2d_546/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_546/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_547/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_547/bias", "shape": [128], "dtype": "float32"}, {"name": "up_sampling2d_92/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_92/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_92/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_92/Const", "shape": [2], "dtype": "int32"}, {"name": "conv2d_548/kernel", "shape": [2, 2, 128, 64], "dtype": "float32"}, {"name": "conv2d_548/bias", "shape": [64], "dtype": "float32"}, {"name": "concatenate_92/concat/axis", "shape": [], "dtype": "int32"}, {"name": "conv2d_549/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_549/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_550/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_550/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_551/kernel", "shape": [3, 3, 64, 2], "dtype": "float32"}, {"name": "conv2d_551/bias", "shape": [2], "dtype": "float32"}, {"name": "conv2d_552/kernel", "shape": [1, 1, 2, 1], "dtype": "float32"}, {"name": "conv2d_552/bias", "shape": [1], "dtype": "float32"}, {"name": "ConstantFolding/dropout_45/cond/dropout/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "dropout_45/cond/dropout/sub", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/dropout_46/cond/dropout/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "dropout_46/cond/dropout/sub", "shape": [], "dtype": "float32"}]}]}