{"format": "graph-model", "generatedBy": "1.13.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "400"}, {"size": "400"}, {"size": "1"}]}}}, "outputs": {"Sigmoid:0": {"name": "Sigmoid:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "400"}, {"size": "400"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "Reshape_25", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "convolution2d_27_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}}}, {"name": "ConstantFolding/dropout_8/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_8/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Reshape_22", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "convolution2d_24_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout_7/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_7/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Reshape_19", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "convolution2d_21_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "128"}]}}}}}, {"name": "ConstantFolding/dropout_6/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_6/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_18_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout_5/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_5/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/dropout_4/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_4/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_13_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "Reshape_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_14_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_15_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Const_15", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "ConstantFolding/dropout_3/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_3/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_10_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "Reshape_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_11_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "Reshape_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_12_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "Reshape_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}}, {"name": "concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "convolution2d_16_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}}, {"name": "convolution2d_17_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "Reshape_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Const_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/dropout_2/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "convolution2d_7_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_8_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "convolution2d_9_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "convolution2d_19_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "convolution2d_20_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "Reshape_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Const_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/dropout_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dropout_1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_4_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_5_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Reshape_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "convolution2d_6_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Reshape_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "convolution2d_22_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "64"}]}}}}}, {"name": "Reshape_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "convolution2d_23_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/dropout/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_1_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_2_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "convolution2d_3_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "Reshape_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "concat_3/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "convolution2d_25_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "32"}]}}}}}, {"name": "Reshape_24", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "convolution2d_26_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "Reshape_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_28_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "convolution2d_29_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "400"}, {"size": "400"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["input_1", "convolution2d_1_W"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "Add", "input": ["Conv2D", "Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu", "op": "Elu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_1", "op": "Conv2D", "input": ["Elu", "convolution2d_2_W"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "Add", "input": ["Conv2D_1", "Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_1", "op": "Elu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/truediv", "op": "Mul", "input": ["ConstantFolding/dropout/truediv_recip", "Elu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout/Shape", "op": "Shape", "input": ["Elu_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout/Shape"], "attr": {"T": {"type": "DT_INT32"}, "seed": {"i": "87654321"}, "seed2": {"i": "8326427"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/add", "op": "Add", "input": ["dropout/sub", "dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Floor", "op": "Floor", "input": ["dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/mul", "op": "Mul", "input": ["dropout/truediv", "dropout/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_2", "op": "Elu", "input": ["dropout/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_2", "op": "Conv2D", "input": ["Elu_2", "convolution2d_3_W"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "add_2", "op": "Add", "input": ["Conv2D_2", "Reshape_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_3", "op": "Elu", "input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_3", "op": "Add", "input": ["add", "Elu_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "AvgPool", "op": "AvgPool", "input": ["add_3"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Conv2D_3", "op": "Conv2D", "input": ["AvgPool", "convolution2d_4_W"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "add_4", "op": "Add", "input": ["Conv2D_3", "Reshape_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_4", "op": "Elu", "input": ["add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_5", "op": "Elu", "input": ["Elu_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_4", "op": "Conv2D", "input": ["Elu_5", "convolution2d_5_W"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "add_5", "op": "Add", "input": ["Conv2D_4", "Reshape_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_6", "op": "Elu", "input": ["add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_1/truediv_recip", "Elu_6"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Shape", "op": "Shape", "input": ["Elu_6"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_1/Shape"], "attr": {"T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed": {"i": "87654321"}, "seed2": {"i": "2265902"}}}, {"name": "dropout_1/add", "op": "Add", "input": ["dropout_1/sub", "dropout_1/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/Floor", "op": "Floor", "input": ["dropout_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_1/mul", "op": "Mul", "input": ["dropout_1/truediv", "dropout_1/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_7", "op": "Elu", "input": ["dropout_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_5", "op": "Conv2D", "input": ["Elu_7", "convolution2d_6_W"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "add_6", "op": "Add", "input": ["Conv2D_5", "Reshape_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_8", "op": "Elu", "input": ["add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_7", "op": "Add", "input": ["Elu_4", "Elu_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "AvgPool_1", "op": "AvgPool", "input": ["add_7"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Conv2D_6", "op": "Conv2D", "input": ["AvgPool_1", "convolution2d_7_W"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "add_8", "op": "Add", "input": ["Conv2D_6", "Reshape_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_9", "op": "Elu", "input": ["add_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_10", "op": "Elu", "input": ["Elu_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_7", "op": "Conv2D", "input": ["Elu_10", "convolution2d_8_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "add_9", "op": "Add", "input": ["Conv2D_7", "Reshape_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_11", "op": "Elu", "input": ["add_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_2/truediv_recip", "Elu_11"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_2/Shape", "op": "Shape", "input": ["Elu_11"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_2/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_2/Shape"], "attr": {"seed": {"i": "87654321"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "9514312"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/add", "op": "Add", "input": ["dropout_2/sub", "dropout_2/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/Floor", "op": "Floor", "input": ["dropout_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_2/mul", "op": "Mul", "input": ["dropout_2/truediv", "dropout_2/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_12", "op": "Elu", "input": ["dropout_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_8", "op": "Conv2D", "input": ["Elu_12", "convolution2d_9_W"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "add_10", "op": "Add", "input": ["Conv2D_8", "Reshape_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_13", "op": "Elu", "input": ["add_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_11", "op": "Add", "input": ["Elu_9", "Elu_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "AvgPool_2", "op": "AvgPool", "input": ["add_11"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_9", "op": "Conv2D", "input": ["AvgPool_2", "convolution2d_10_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_12", "op": "Add", "input": ["Conv2D_9", "Reshape_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_14", "op": "Elu", "input": ["add_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_15", "op": "Elu", "input": ["Elu_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_10", "op": "Conv2D", "input": ["Elu_15", "convolution2d_11_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_13", "op": "Add", "input": ["Conv2D_10", "Reshape_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_16", "op": "Elu", "input": ["add_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_3/truediv_recip", "Elu_16"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/Shape", "op": "Shape", "input": ["Elu_16"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_3/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_3/Shape"], "attr": {"seed2": {"i": "8053923"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed": {"i": "87654321"}}}, {"name": "dropout_3/add", "op": "Add", "input": ["dropout_3/sub", "dropout_3/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/Floor", "op": "Floor", "input": ["dropout_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_3/mul", "op": "Mul", "input": ["dropout_3/truediv", "dropout_3/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_17", "op": "Elu", "input": ["dropout_3/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_11", "op": "Conv2D", "input": ["Elu_17", "convolution2d_12_W"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_14", "op": "Add", "input": ["Conv2D_11", "Reshape_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_18", "op": "Elu", "input": ["add_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_15", "op": "Add", "input": ["Elu_14", "Elu_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "AvgPool_3", "op": "AvgPool", "input": ["add_15"], "attr": {"T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Conv2D_12", "op": "Conv2D", "input": ["AvgPool_3", "convolution2d_13_W"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "add_16", "op": "Add", "input": ["Conv2D_12", "Reshape_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_19", "op": "Elu", "input": ["add_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_13", "op": "Conv2D", "input": ["Elu_19", "convolution2d_14_W"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "add_17", "op": "Add", "input": ["Conv2D_13", "Reshape_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_20", "op": "Elu", "input": ["add_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_4/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_4/truediv_recip", "Elu_20"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_4/Shape", "op": "Shape", "input": ["Elu_20"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_4/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_4/Shape"], "attr": {"seed": {"i": "87654321"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "2574616"}, "T": {"type": "DT_INT32"}}}, {"name": "dropout_4/add", "op": "Add", "input": ["dropout_4/sub", "dropout_4/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_4/Floor", "op": "Floor", "input": ["dropout_4/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_4/mul", "op": "Mul", "input": ["dropout_4/truediv", "dropout_4/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_21", "op": "Elu", "input": ["dropout_4/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_14", "op": "Conv2D", "input": ["Elu_21", "convolution2d_15_W"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "add_18", "op": "Add", "input": ["Conv2D_14", "Reshape_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_22", "op": "Elu", "input": ["add_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_19", "op": "Add", "input": ["add_16", "Elu_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Shape", "op": "Shape", "input": ["add_19"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "mul_5", "op": "Mul", "input": ["strided_slice", "Const_15"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["add_19", "mul_5"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": false}}}, {"name": "concat", "op": "ConcatV2", "input": ["ResizeNearestNeighbor", "add_15", "concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Conv2D_16", "op": "Conv2D", "input": ["concat", "convolution2d_18_W"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Elu_23", "op": "Elu", "input": ["concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_15", "op": "Conv2D", "input": ["Elu_23", "convolution2d_16_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_20", "op": "Add", "input": ["Conv2D_15", "Reshape_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_24", "op": "Elu", "input": ["add_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_5/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_5/truediv_recip", "Elu_24"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_5/Shape", "op": "Shape", "input": ["Elu_24"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_5/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_5/Shape"], "attr": {"T": {"type": "DT_INT32"}, "seed": {"i": "87654321"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "3559914"}}}, {"name": "dropout_5/add", "op": "Add", "input": ["dropout_5/sub", "dropout_5/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_5/Floor", "op": "Floor", "input": ["dropout_5/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_5/mul", "op": "Mul", "input": ["dropout_5/truediv", "dropout_5/Floor"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "Elu_25", "op": "Elu", "input": ["dropout_5/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_17", "op": "Conv2D", "input": ["Elu_25", "convolution2d_17_W"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "add_22", "op": "Add", "input": ["Conv2D_17", "Reshape_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_26", "op": "Elu", "input": ["add_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_23", "op": "AddN", "input": ["Conv2D_16", "Elu_26"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_23", "op": "Add", "input": ["Reshape_16", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_23"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Shape_1", "op": "Shape", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_23"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["Shape_1", "strided_slice_1/stack", "strided_slice_1/stack_1", "strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "mul_7", "op": "Mul", "input": ["strided_slice_1", "Const_19"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ResizeNearestNeighbor_1", "op": "ResizeNearestNeighbor", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_23", "mul_7"], "attr": {"T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": false}, "align_corners": {"b": false}}}, {"name": "concat_1", "op": "ConcatV2", "input": ["ResizeNearestNeighbor_1", "add_11", "concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_19", "op": "Conv2D", "input": ["concat_1", "convolution2d_21_W"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Elu_27", "op": "Elu", "input": ["concat_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_18", "op": "Conv2D", "input": ["Elu_27", "convolution2d_19_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "add_24", "op": "Add", "input": ["Conv2D_18", "Reshape_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_28", "op": "Elu", "input": ["add_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_6/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_6/truediv_recip", "Elu_28"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_6/Shape", "op": "Shape", "input": ["Elu_28"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_6/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_6/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed": {"i": "87654321"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "5708652"}}}, {"name": "dropout_6/add", "op": "Add", "input": ["dropout_6/sub", "dropout_6/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_6/Floor", "op": "Floor", "input": ["dropout_6/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_6/mul", "op": "Mul", "input": ["dropout_6/truediv", "dropout_6/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_29", "op": "Elu", "input": ["dropout_6/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_20", "op": "Conv2D", "input": ["Elu_29", "convolution2d_20_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "add_26", "op": "Add", "input": ["Conv2D_20", "Reshape_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_30", "op": "Elu", "input": ["add_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_27", "op": "AddN", "input": ["Conv2D_19", "Elu_30"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_27", "op": "Add", "input": ["Reshape_19", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_27"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Shape_2", "op": "Shape", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_27"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice_2", "op": "StridedSlice", "input": ["Shape_2", "strided_slice_2/stack", "strided_slice_2/stack_1", "strided_slice_2/stack_2"], "attr": {"begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "mul_9", "op": "Mul", "input": ["strided_slice_2", "Const_23"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ResizeNearestNeighbor_2", "op": "ResizeNearestNeighbor", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_27", "mul_9"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "concat_2", "op": "ConcatV2", "input": ["ResizeNearestNeighbor_2", "add_7", "concat_2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Conv2D_22", "op": "Conv2D", "input": ["concat_2", "convolution2d_24_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_31", "op": "Elu", "input": ["concat_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_21", "op": "Conv2D", "input": ["Elu_31", "convolution2d_22_W"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "add_28", "op": "Add", "input": ["Conv2D_21", "Reshape_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_32", "op": "Elu", "input": ["add_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_7/truediv", "op": "Mul", "input": ["ConstantFolding/dropout_7/truediv_recip", "Elu_32"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "dropout_7/Shape", "op": "Shape", "input": ["Elu_32"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_7/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_7/Shape"], "attr": {"seed": {"i": "87654321"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "1544805"}}}, {"name": "dropout_7/add", "op": "Add", "input": ["dropout_7/sub", "dropout_7/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_7/Floor", "op": "Floor", "input": ["dropout_7/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_7/mul", "op": "Mul", "input": ["dropout_7/truediv", "dropout_7/Floor"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Elu_33", "op": "Elu", "input": ["dropout_7/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_23", "op": "Conv2D", "input": ["Elu_33", "convolution2d_23_W"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "add_30", "op": "Add", "input": ["Conv2D_23", "Reshape_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Elu_34", "op": "Elu", "input": ["add_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_31", "op": "AddN", "input": ["Conv2D_22", "Elu_34"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}}}, {"name": "ArithmeticOptimizer/AddOpsRewrite_add_31", "op": "Add", "input": ["Reshape_22", "ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_31"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Shape_3", "op": "Shape", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_31"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "strided_slice_3", "op": "StridedSlice", "input": ["Shape_3", "strided_slice_3/stack", "strided_slice_3/stack_1", "strided_slice_3/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "mul_11", "op": "Mul", "input": ["strided_slice_3", "Const_27"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ResizeNearestNeighbor_3", "op": "ResizeNearestNeighbor", "input": ["ArithmeticOptimizer/AddOpsRewrite_add_31", "mul_11"], "attr": {"half_pixel_centers": {"b": false}, "align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "concat_3", "op": "ConcatV2", "input": ["ResizeNearestNeighbor_3", "add_3", "concat_3/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Conv2D_25", "op": "Conv2D", "input": ["concat_3", "convolution2d_27_W"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Elu_35", "op": "Elu", "input": ["concat_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_24", "op": "Conv2D", "input": ["Elu_35", "convolution2d_25_W"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, 